In [3]:
import pandas as pd
import numpy as np

## 01 Class exercise slicing dataframe
Use this data:
```python
data = np.array([['','Col1','Col2','col3'],
                ['Row1',1,2,3],
                ['Row2',4,5,6],
                ['Row3',7,8,9]])
```
1. Create a DataFrame (wrap the data above in a pandas DataFrame in a way that printing the dataframe and its index and column attributes gives this result)  
`pd.DataFrame(data=data[1:4,1:4], columns=data[0,1:4], index=data[1:4,0])`  

``` 
     Col1 Col2 col3  
Row1    1    2    3
Row2    4    5    6
Row3    7    8    9

Index(['Row1', 'Row2', 'Row3'], dtype='object')
Index(['Col1', 'Col2', 'col3'], dtype='object')
```

2. Make slices of data:
   1. second column using column name
   2. third column using column index (.iloc[])
   3. slice element at third row of second column (use .iloc())

In [10]:
data = np.array([['','Col1','Col2','col3'],
                ['Row1',1,2,3],
                ['Row2',4,5,6],
                ['Row3',7,8,9]])
pd_data = pd.DataFrame(data=data[1:4,1:4], columns=data[0,1:4], index=data[1:4,0])

In [11]:
pd_data['Col2']

Row1    2
Row2    5
Row3    8
Name: Col2, dtype: object

In [12]:
pd_data.iloc[:,2]

Row1    3
Row2    6
Row3    9
Name: col3, dtype: object

In [13]:
pd_data.iloc[2,1]

'8'

## 02 Exercise Pandas Data Series
The CO2 Emission data set above is not updated since 2014
1. Create a Pandas Series with emission data from 2014 for each country or region
2. Find the 10 Countries/Regions with the highest emissions in 2014 and show emission numbers (reverse sorted)
3. Remove if you can those rows that are not countries (regions and aggregated groups) (hint:  [ISO 3166, Alpha-3 country codes](https://www.iban.com/country-codes), a csv file can be found here: `/data/country_codes.csv`)
    - Find the 10 countries with highest emissions in 2014
4. Plot the emissions of China and USA over time respectively

In [33]:
data = pd.read_csv('../../../data/API_EN.ATM.CO2E.KT_DS2_en_csv_v2_1345584.csv', skiprows=4)
columns_names = data.columns
countries = data['Country Name']

data_2014 = data[['Country Name','Country Code','2014']]
data_2014.sort_values('2014', ascending=True)[:10]

              Country Name Country Code     2014
243                 Tuvalu          TUV   11.001
177                  Nauru          NRU   47.671
135          Liechtenstein          LIE   47.671
122               Kiribati          KIR   58.672
217  Sao Tome and Principe          STP  113.677
237                  Tonga          TON  113.677
77   Micronesia, Fed. Sts.          FSM  135.679
153       Marshall Islands          MHL  143.013
44                 Comoros          COM  154.014
256                Vanuatu          VUT  154.014

## 03 Exercise pandas dataframe
1. Using the dataframe in the above cell find:
    1. Mean, Min, Max values for all 4 columns
    2. The 2 dates with the largest and smallest sum (by column)
    3. All dates where both A's and B's are positive

In [37]:
dates = pd.date_range('20200602', periods=6) # create 6 dates from september 2nd, 2020.
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD')) # use np.random.randn to generate a dataframe of 6 by 4 random numbers
print(df)

                   A         B         C         D
2020-06-02 -0.397595 -1.021712 -0.955889  0.305789
2020-06-03 -0.916397 -0.694291  1.392986 -1.434113
2020-06-04 -1.328007  0.363118 -0.871026 -1.990069
2020-06-05 -2.242924 -0.339488 -1.173485  2.118540
2020-06-06 -0.533510 -0.320298  0.230559 -0.455743
2020-06-07 -1.627848 -0.466459 -0.997179  0.331974

In [38]:
df.describe().loc[['mean','min','max']]

             A         B         C         D
mean -1.174380 -0.413189 -0.395672 -0.187270
min  -2.242924 -1.021712 -1.173485 -1.990069
max  -0.397595  0.363118  1.392986  2.118540

In [62]:
df["Sum"] = df.sum(axis=1)

In [74]:
df[df['Sum'] ==df.min().loc['Sum']]

                   A         B         C         D      total         Sum
2020-06-04 -1.328007  0.363118 -0.871026 -1.990069 -15.303936 -133.909437

In [75]:
df[df['Sum'] ==df.max().loc['Sum']]

                  A         B         C         D     total        Sum
2020-06-06 -0.53351 -0.320298  0.230559 -0.455743 -4.315972 -37.764752